## Soal 2 - Data Analytic

In [32]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [33]:
df = pd.read_csv('profesi.csv')
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [34]:
# banyak profesi
print ("Banyak profesi = %s" %(df['occupation'].nunique()))

Banyak profesi = 21

In [35]:
#jenis profesi yang ada
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [36]:
#Buatlah sebuah dataframe yang menunjukkan data usia maksimal, minimal & rata-ratanya, kemudian dikelompokkan berdasarkan gender!
result = pd.DataFrame(df.groupby(['gender']).agg(
    usia_max= ('age','max'),
    usia_min=('age','min'),
    usia_rata_rata=('age','mean'),
)).reset_index()
result

  gender  usia_max  usia_min  usia_rata_rata
0      F        70        13       33.813187
1      M        73         7       34.149254

In [37]:
#Buatlah sebuah dataframe yang menunjukkan persentase pria & wanita
persen = df.groupby("gender").agg(
    jml=pd.NamedAgg(column="gender", aggfunc="count")
).reset_index()

persen['persentage'] = round(100 * persen['jml'] / persen.jml.sum(),1)
persen

  gender  jml  persentage
0      F  273        29.0
1      M  670        71.0